{"jobs": {"3": {"id": "9fd26863-d034-41aa-9717-34fe24207b87", "name": "Analista de TI Pleno", "main_activities": "\nSuporte Técnico: Fornecer suporte técnico a usuários internos, solucionando problemas de hardware e software.\nGestão de Projetos: Participar da gestão de projetos de tecnologia, colaborando na definição de escopo, cronograma e recursos.\nDesenvolvimento de Sistemas: Auxiliar no desenvolvimento e manutenção de sistemas internos, garantindo a integração com outras plataformas.\nAnálise de Dados: Realizar análises de dados para gerar relatórios e insights que apoiem a tomada de decisões.\nTreinamento e Capacitação: Conduzir treinamentos para usuários sobre novas ferramentas e sistemas implementados.", "prerequisites": "Formação: Graduação em Ciência da Computação, Sistemas de Informação ou áreas correlatas.\nExperiência: Mínimo de 3 anos de experiência em suporte técnico e desenvolvimento de software.\nConhecimentos Técnicos: Domínio em linguagens de programação como Java, Python ou C#; conhecimento em bancos de dados SQL; familiaridade com metodologias ágeis (Scrum/Kanban).\nHabilidades Interpessoais: Boa comunicação verbal e escrita; capacidade de trabalhar em equipe e resolver conflitos.", "differentials": "Certificações: Certificações em ITIL, PMP ou Scrum Master serão consideradas um diferencial.\nExperiência em Cloud Computing: Conhecimento em plataformas como AWS ou Azure.\nInglês Avançado: Habilidade para leitura e compreensão de documentação técnica em inglês.\nProjetos Pessoais: Participação em projetos open source ou desenvolvimento de soluções inovadoras."}, "4": {"id": "0671f9bc-2d86-4526-871a-c0ac30bfc4a5", "name": "Desenvolvedor Front-end", "main_activities": "Desenvolvimento de Interfaces: Criar e implementar interfaces de usuário responsivas e intuitivas utilizando HTML, CSS e JavaScript.\nColaboração com Designers: Trabalhar em estreita colaboração com a equipe de design para transformar wireframes e protótipos em experiências funcionais.\nOtimização de Performance: Realizar otimizações de performance para garantir que as aplicações sejam rápidas e eficientes.\nIntegração com APIs: Conectar aplicações front-end a APIs RESTful, garantindo uma comunicação eficaz entre o cliente e o servidor.\nTestes e Manutenção: Escrever testes automatizados e realizar manutenção contínua das aplicações existentes.", "prerequisites": "Formação: Graduação em Ciência da Computação, Engenharia de Software ou áreas afins.\nExperiência: Mínimo de 2 anos de experiência em desenvolvimento front-end.\nConhecimentos Técnicos: Proficiência em frameworks como React, Angular ou Vue.js; conhecimento sólido em HTML5, CSS3 e JavaScript ES6+.\nFerramentas de Versionamento: Experiência com Git e ferramentas de controle de versão.", "differentials": "Experiência em UX/UI: Conhecimento em princípios de design de experiência do usuário (UX) e interface do usuário (UI).\nFamiliaridade com TypeScript: Experiência prévia com TypeScript é um diferencial importante.\nContribuições Open Source: Participação em projetos open source ou portfólio de projetos pessoais será valorizada.\nInglês Intermediário: Capacidade de leitura e compreensão de documentação técnica em inglês."}}, "resums": {"1": {"id": "cf76a6c1-c4f8-4e0a-a511-0753d11a0d40", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "content": "\n## Nome Completo\nRafael Souza Lima\n\n## Experiência\nEngenheiro de Machine Learning na Data Science Corp. (Agosto de 2021 - Presente) com experiência em desenvolvimento de modelos preditivos para análise de dados financeiros utilizando Python e TensorFlow. Desenvolvedor Backend na Innovative Apps (Janeiro de 2020 - Julho de 2021) com experiência em criação de APIs RESTful em Node.js e otimização do desempenho do banco de dados SQL.\n\n## Habilidades \nLinguagens: Python, JavaScript, R, SQL. Frameworks: TensorFlow, Flask, Express.js. Ferramentas: Git, Docker, AWS.\n\n## Educação \nMestrado em Inteligência Artificial pela Universidade Federal do Rio de Janeiro (UFRJ), concluído em Julho de 2021. Bacharelado em Ciência da Computação pela Universidade Federal de Minas Gerais (UFMG), concluído em Dezembro de 2019.\n\n## Idiomas \nNão especificado no currículo fornecido.", "opinion": "**Relatório de Análise do Currículo**\n\n**Resumo Executivo**\n\nO currículo de Rafael Souza Lima foi analisado em relação à vaga de Analista de TI Pleno. Embora o candidato tenha uma formação acadêmica sólida e experiência relevante em desenvolvimento de software, existem algumas lacunas em suas habilidades técnicas e experiência que não atendem completamente aos requisitos da vaga.\n\n**Pontos de Alinhamento**\n\n* **Formação Acadêmica**: O candidato possui um mestrado em Inteligência Artificial e um bacharelado em Ciência da Computação, o que atende aos requisitos de formação da vaga.\n* **Experiência em Desenvolvimento de Software**: O candidato tem experiência em desenvolvimento de software, incluindo a criação de APIs RESTful em Node.js e a otimização de desempenho de bancos de dados SQL.\n* **Habilidades Técnicas**: O candidato possui habilidades em linguagens de programação como Python, JavaScript e R, além de conhecimento em frameworks como TensorFlow e Express.js.\n\n**Pontos de Desalinhamento**\n\n* **Linguagem de Programação**: Embora o candidato tenha habilidades em linguagens de programação como Python e JavaScript, não há evidência de conhecimento em Java ou C#, que são linguagens de programação mencionadas nos requisitos da vaga.\n* **Experiência em Suporte Técnico**: Embora o candidato tenha experiência em desenvolvimento de software, não há evidência de experiência em suporte técnico, que é um requisito importante da vaga.\n* **Metodologias Ágeis**: Embora o candidato tenha habilidades em desenvolvimento de software, não há evidência de conhecimento em metodologias ágeis como Scrum/Kanban.\n\n**Pontos de Atenção**\n\n* **Frequência de Troca de Emprego**: O candidato trocou de emprego recentemente, o que pode ser um sinal de instabilidade.\n* **Lacunas no Histórico de Trabalho**: Não há informações sobre o histórico de trabalho do candidato antes de 2020, o que pode ser um sinal de falta de experiência.\n* **Habilidades Interpessoais**: Embora o candidato tenha habilidades técnicas, não há evidência de habilidades interpessoais, como comunicação verbal e escrita, que são importantes para o cargo.\n\n**Conclusão**\n\nEm resumo, o currículo de Rafael Souza Lima apresenta alguns pontos de alinhamento com a vaga de Analista de TI Pleno, mas também há alguns pontos de desalinhamento e atenção que precisam ser considerados. Embora o candidato tenha formação acadêmica e experiência relevante, existem lacunas em suas habilidades técnicas e experiência que precisam ser abordadas. É recomendável que o candidato seja entrevistado para discutir essas lacunas e avaliar sua capacidade de aprender e se adaptar às necessidades da empresa.", "file": "curriculos\\Rafael Souza Lima.pdf"}, "2": {"id": "2b101d1c-e678-412d-8969-52fd7525b78c", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "content": "## Nome Completo\nAna Clara Martins\n\n## Experiência\nDesenvolvedora Sênior na Tech Innovations (Janeiro de 2021 - Presente) e Desenvolvedora Full Stack na SoftWare Solutions (Julho de 2018 - Dezembro de 2020).\n\n## Habilidades \nLinguagens: JavaScript, Python, Java, SQL. Frameworks: React, Node.js, Django. Ferramentas: Git, Docker, Kubernetes, AWS.\n\n## Educação \nMestrado em Ciência da Computação pela Universidade de São Paulo (USP) e Bacharelado em Engenharia da Computação pela Universidade Estadual de Campinas (UNICAMP).\n\n## Idiomas \nNão informado no currículo original.", "opinion": "**Relatório Analítico do Currículo**\n\n**Resumo Executivo**\n\nO currículo de Ana Clara Martins foi analisado em relação à vaga de Analista de TI Pleno. Embora o currículo apresente pontos fortes, como experiência em desenvolvimento de software e habilidades técnicas relevantes, também existem áreas de desalinhamento e pontos de atenção que devem ser considerados.\n\n**Pontos de Alinhamento**\n\n* **Formação**: Ana Clara Martins possui graduação em Engenharia da Computação e mestrado em Ciência da Computação, o que atende ao requisito de formação da vaga.\n* **Experiência**: Ana Clara Martins tem experiência em desenvolvimento de software e liderança de equipe, o que é relevante para a vaga de Analista de TI Pleno.\n* **Habilidades Técnicas**: Ana Clara Martins possui habilidades em linguagens de programação como JavaScript, Python e Java, além de conhecimento em frameworks como React e Django.\n* **Ferramentas**: Ana Clara Martins tem experiência com ferramentas como Git, Docker e Kubernetes, o que é relevante para a vaga.\n\n**Pontos de Desalinhamento**\n\n* **Suporte Técnico**: Embora Ana Clara Martins tenha experiência em desenvolvimento de software, não há evidências de experiência em suporte técnico, o que é um requisito importante da vaga.\n* **Gestão de Projetos**: Ana Clara Martins não possui experiência explícita em gestão de projetos, o que é um requisito da vaga.\n* **Análise de Dados**: Embora Ana Clara Martins tenha habilidades em linguagens de programação, não há evidências de experiência em análise de dados, o que é um requisito da vaga.\n\n**Pontos de Atenção**\n\n* **Frequência de Troca de Emprego**: Ana Clara Martins trocou de emprego em 2020, o que pode ser um ponto de atenção em relação à estabilidade e comprometimento com a empresa.\n* **Lacunas no Histórico de Trabalho**: Não há informações sobre o que Ana Clara Martins fez entre 2020 e 2021, o que pode ser um ponto de atenção em relação à continuidade da carreira.\n* **Características Pessoais**: Ana Clara Martins não menciona habilidades interpessoais ou capacidade de trabalhar em equipe, o que é um requisito importante da vaga.\n\n**Conclusão**\n\nEm resumo, o currículo de Ana Clara Martins apresenta pontos fortes em relação à formação e experiência em desenvolvimento de software, mas também existem áreas de desalinhamento e pontos de atenção que devem ser considerados. É importante realizar uma entrevista para discutir esses pontos e avaliar a compatibilidade de Ana Clara Martins com a vaga de Analista de TI Pleno.", "file": "curriculos\\Ana Clara Martins.pdf"}, "3": {"id": "53bba85a-8cc4-4f1d-b740-f2c69dd760ad", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "content": "\n## Nome Completo\nBeatriz Oliveira Santos\n\n## Experiência\nArquiteta de Software na Global Tech Solutions (Abril de 2023 - Presente) e Desenvolvedora Frontend na Creative Web Agency (Janeiro de 2018 - Março de 2023)\n\n## Habilidades \nLinguagens: JavaScript, TypeScript, HTML/CSS, Frameworks: Angular, Vue.js, Bootstrap, Ferramentas: Git, JIRA, Figma\n\n## Educação \nDoutorado em Engenharia de Software pela Universidade Federal do Paraná (UFPR) e Bacharelado em Sistemas de Informação pela Universidade Federal do Espírito Santo (UFES)\n\n## Idiomas \nNão especificado no currículo original.\n```", "opinion": "**Relatório de Análise de Currículo**\n\n**Vaga:** Analista de TI Pleno\n**Candidato:** Beatriz Oliveira Santos\n\n**Pontos de Alinhamento**\n\nA Beatriz Oliveira Santos possui uma formação sólida em Engenharia de Software e Sistemas de Informação, o que está alinhado com os requisitos da vaga. Além disso, ela tem experiência em desenvolvimento de software e suporte técnico, o que é fundamental para a posição de Analista de TI Pleno.\n\n* Experiência como Arquiteta de Software na Global Tech Solutions, onde foi responsável pelo design e implementação da arquitetura para sistemas corporativos complexos.\n* Experiência como Desenvolvedora Frontend na Creative Web Agency, onde criou interfaces intuitivas e responsivas utilizando Angular e Vue.js.\n* Conhecimento em linguagens de programação como JavaScript, TypeScript, HTML/CSS e frameworks como Angular, Vue.js e Bootstrap.\n\n**Pontos de Desalinhamento**\n\nA Beatriz Oliveira Santos não possui experiência direta em suporte técnico, o que é um dos principais requisitos da vaga. Além disso, ela não tem conhecimento em linguagens de programação como Java, Python ou C#, que são mencionadas como requisitos da vaga.\n\n* Falta de experiência em suporte técnico, o que pode ser um desafio para a posição de Analista de TI Pleno.\n* Ausência de conhecimento em linguagens de programação como Java, Python ou C#, que são fundamentais para a posição.\n* Não há menção a conhecimento em bancos de dados SQL, o que é um requisito importante para a vaga.\n\n**Pontos de Atenção**\n\nA Beatriz Oliveira Santos tem uma formação acadêmica sólida e experiência em desenvolvimento de software, o que é um ponto positivo. No entanto, é importante notar que ela mudou de emprego recentemente, o que pode ser um sinal de falta de estabilidade.\n\n* Frequência de troca de emprego: a Beatriz Oliveira Santos mudou de emprego recentemente, o que pode ser um sinal de falta de estabilidade.\n* Ausência de certificações: a Beatriz Oliveira Santos não tem certificações mencionadas em seu currículo, o que pode ser um desafio para a posição de Analista de TI Pleno.\n\n**Conclusão**\n\nA Beatriz Oliveira Santos é uma candidata com uma formação acadêmica sólida e experiência em desenvolvimento de software. No entanto, ela não possui experiência direta em suporte técnico e falta conhecimento em linguagens de programação como Java, Python ou C#. Além disso, é importante notar que ela mudou de emprego recentemente, o que pode ser um sinal de falta de estabilidade.\n\n**Recomendação**\n\nA Beatriz Oliveira Santos pode ser uma boa candidata para a posição de Analista de TI Pleno, mas é importante realizar uma entrevista mais aprofundada para avaliar sua experiência e habilidades. Além disso, é importante verificar se ela está disposta a aprender e se adaptar às necessidades da empresa.", "file": "curriculos\\Beatriz Oliveira Santos.pdf"}, "4": {"id": "314a0e05-c14b-4924-b831-18d273503350", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "content": "## Nome Completo\nLucas Pereira Gomes\n\n## Experiência\nEspecialista em Segurança da Informação na SecureTech Solutions (2022 - Presente) e Desenvolvedor Backend na TechGuardians Inc. (2020 - 2022)\n\n## Habilidades\nLinguagens: Java, Python, C#; Frameworks: Spring Boot, .NET Core; Ferramentas: Git, Jenkins, OWASP ZAP\n\n## Educação\nMestrado em Segurança da Informação pela Pontifícia Universidade Católica do Rio Grande do Sul (PUCRS) e Bacharelado em Ciência da Computação pela Universidade Federal do Rio Grande do Sul (UFRGS)\n\n## Idiomas\nNão especificado", "opinion": "**Análise Crítica do Currículo de Lucas Pereira Gomes em Relação à Vaga de Analista de TI Pleno**\n\n**Pontos de Alinhamento**\n\nO currículo de Lucas Pereira Gomes apresenta alguns pontos de alinhamento com os requisitos da vaga de Analista de TI Pleno. Aqui estão alguns exemplos:\n\n* **Formação**: O candidato possui um bacharelado em Ciência da Computação, que é uma das áreas de formação exigidas pela vaga.\n* **Experiência**: Lucas tem experiência em desenvolvimento de software, tendo trabalhado como Desenvolvedor Backend na TechGuardians Inc. durante 2 anos e como Especialista em Segurança da Informação na SecureTech Solutions desde novembro de 2022.\n* **Habilidades técnicas**: O candidato tem conhecimento em linguagens de programação como Java, Python e C#, o que é exigido pela vaga. Além disso, ele também tem experiência com frameworks como Spring Boot e .NET Core.\n* **Ferramentas**: Lucas tem experiência com ferramentas como Git, Jenkins e OWASP ZAP, o que pode ser útil para a gestão de projetos e desenvolvimento de sistemas.\n\n**Pontos de Desalinhamento**\n\nNo entanto, existem alguns pontos de desalinhamento entre o currículo de Lucas e os requisitos da vaga. Aqui estão alguns exemplos:\n\n* **Experiência em suporte técnico**: Embora Lucas tenha experiência em desenvolvimento de software, não há evidências de que ele tenha experiência em suporte técnico, o que é um requisito importante da vaga.\n* **Conhecimento em bancos de dados SQL**: Embora Lucas tenha experiência com linguagens de programação, não há evidências de que ele tenha conhecimento em bancos de dados SQL, o que é um requisito importante da vaga.\n* **Familiaridade com metodologias ágeis**: Embora Lucas tenha experiência em desenvolvimento de software, não há evidências de que ele tenha familiaridade com metodologias ágeis como Scrum ou Kanban, o que é um requisito importante da vaga.\n\n**Pontos de Atenção**\n\nExistem alguns pontos de atenção no currículo de Lucas que merecem ser destacados. Aqui estão alguns exemplos:\n\n* **Frequência de troca de emprego**: Lucas trocou de emprego recentemente, o que pode ser um sinal de que ele está procurando por um desafio novo ou que ele não está satisfeito com seu atual emprego.\n* **Lacunas no histórico de trabalho**: Não há lacunas no histórico de trabalho de Lucas, o que é um sinal de que ele tem uma boa estabilidade no mercado de trabalho.\n* **Características pessoais**: Lucas tem uma boa formação e experiência em desenvolvimento de software, o que pode ser um sinal de que ele é uma pessoa motivada e capaz de aprender rapidamente.\n\n**Conclusão**\n\nEm resumo, o currículo de Lucas Pereira Gomes apresenta alguns pontos de alinhamento com os requisitos da vaga de Analista de TI Pleno, mas também existem alguns pontos de desalinhamento que precisam ser considerados. É importante realizar uma entrevista com Lucas para discutir esses pontos e avaliar sua capacidade de trabalhar em equipe, resolver conflitos e aprender rapidamente. Além disso, é importante verificar se Lucas tem experiência em suporte técnico e conhecimento em bancos de dados SQL, o que é essencial para a vaga.", "file": "curriculos\\Lucas Pereira Gomes.pdf"}}, "analysis": {"1": {"id": "9748a6a4-c101-403d-9fae-793da4628bfc", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "resum_id": "cf76a6c1-c4f8-4e0a-a511-0753d11a0d40", "name": "Rafael Souza Lima", "skills": ["Linguagens: Python, JavaScript, R, SQL. Frameworks: TensorFlow, Flask, Express.js. Ferramentas: Git, Docker, AWS."], "education": ["Mestrado em Inteligência Artificial pela Universidade Federal do Rio de Janeiro (UFRJ), concluído em Julho de 2021. Bacharelado em Ciência da Computação pela Universidade Federal de Minas Gerais (UFMG), concluído em Dezembro de 2019."], "language": ["Não especificado no currículo fornecido."], "score": 8.45}, "2": {"id": "8db3b47e-7402-43c9-ad5b-71e0566fcb59", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "resum_id": "2b101d1c-e678-412d-8969-52fd7525b78c", "name": "Ana Clara Martins", "skills": ["Linguagens: JavaScript, Python, Java, SQL. Frameworks: React, Node.js, Django. Ferramentas: Git, Docker, Kubernetes, AWS."], "education": ["Mestrado em Ciência da Computação pela Universidade de São Paulo (USP) e Bacharelado em Engenharia da Computação pela Universidade Estadual de Campinas (UNICAMP)."], "language": ["Não informado no currículo original."], "score": 8.5}, "3": {"id": "5d9ffe74-5e71-4594-afff-dc1f041af513", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "resum_id": "53bba85a-8cc4-4f1d-b740-f2c69dd760ad", "name": "Beatriz Oliveira Santos", "skills": ["Linguagens: JavaScript, TypeScript, HTML/CSS, Frameworks: Angular, Vue.js, Bootstrap, Ferramentas: Git, JIRA, Figma"], "education": ["Doutorado em Engenharia de Software pela Universidade Federal do Paraná (UFPR) e Bacharelado em Sistemas de Informação pela Universidade Federal do Espírito Santo (UFES)"], "language": ["Não especificado no currículo original.", "```"], "score": 7.4}, "4": {"id": "cc93e1d4-2846-4c27-865b-da3150f58df5", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87", "resum_id": "314a0e05-c14b-4924-b831-18d273503350", "name": "Lucas Pereira Gomes", "skills": ["Linguagens: Java, Python, C#; Frameworks: Spring Boot, .NET Core; Ferramentas: Git, Jenkins, OWASP ZAP"], "education": ["Mestrado em Segurança da Informação pela Pontifícia Universidade Católica do Rio Grande do Sul (PUCRS) e Bacharelado em Ciência da Computação pela Universidade Federal do Rio Grande do Sul (UFRGS)"], "language": ["Não especificado"], "score": 7.2}}, "files": {"1": {"file_id": "471aee35-838c-4729-9d37-52c44edc8bb9", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87"}, "2": {"file_id": "c350523e-6c84-4c85-8bc8-72cd41ff12b0", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87"}, "3": {"file_id": "c1d4b501-31bb-46d2-a70b-5a5dcb20e058", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87"}, "4": {"file_id": "fd4d3087-2ade-441d-9c5a-7df827be50b3", "job_id": "9fd26863-d034-41aa-9717-34fe24207b87"}}}